public class Application {
    public static void main(String[] args){
// здесь метод с запросом на открытие зала
// создаю обьект - в его классе будет рандомно создаваться загрузка в момент открытия

//  здесь метод вывода доступных зон с количеством свободных мест.

// создаю объект клиетна
// ввожу его даннные в формате
// имя - фамилия - год рождения - зона желаемого посещения  (руководствуясь таблицей вывода)
// в случае если места в желаемой зоне нет или посещение в эти часы не возможно предлагаю другой вариант либо отказываю

}
}
